import pytest


@pytest.mark.parametrize(
    "thai, expected",
    [
        # I группа - заднеязычные
        ("ไก่", "кайˆ"),
        ("ไข่", "кˣайˆ"),
        ("ฃวด", "кˣӯатˆ"),
        ("ควาย", "кˣуа̄й"),
        ("ฅน", "кˣон"),
        ("ระฆัง", "раˇ-кˣанг"),
        ("งู", "нгӯ"),
        # II группа - палатальные
        ("จาน", "тьа̄н"),
        ("ฉิ่ง", "чингˆ"),
        ("ช้าง", "ча̄нгˇ"),
        ("โซ่", "сɔ̄`"),
        ("กะเฌอ", "каˆ-чə̄"),
        ("หญิง", "йинг´"),
        # III группа - зазубные*
        ("ชะฎา", "чаˇ-да̄"),
        ("ปะฏัก", "паˆ-такˆ"),
        ("ฐาน", "тˣа̄н´"),
        ("มณโฑ", "мон-тˣɔ̄"),
        ("ผู้เฒ่า", "пˣӯ`-тˣау`"),
        ("เณร", "не̄н"),
        # IV группа - зазубные
        ("เด็ก", "декˆ"),
        ("เต่า", "тауˆ"),
        ("ถุง", "тˣунг´"),
        ("ทหาร", "тˣаˇ-ха̄н´"),
        ("ธง", "тˣонг"),
        ("หนู", "нӯ´"),
        # V группа - губные
        ("ใบไม้", "бай-майˇ"),
        ("ปลา", "пла̄"),
        ("ผึ้ง", "пˣынг`"),
        ("ฝา", "фа̄´"),
        ("พาน", "пˣа̄н"),
        ("ฟัน", "фан"),
        ("สำเภา", "сам´-пˣау"),
        ("ม้า", "ма̄ˇ"),
        # VI группа - разные
        ("ยักษ์", "йакˇ"),
        ("เรือ", "ры̄а"),
        ("ลิง", "линг"),
        ("แหวน", "вэ̄н´"),
        ("ศาลา", "са̄´-ла̄"),
        ("ฤๅษี", "ры̄-сӣ´"),
        ("เสือ", "сы̄а´"),
        ("หีบ", "хӣпˆ"),
        ("จุฬา", "тьуˆ-ла̄"),
        ("อ่าง", "а̄нгˆ"),
        ("นกฮูก", "нокˇ-хӯк`"),
    ],
)
def test_morev_alphabet_table_examples(thai: str, expected: str, morev_transcribe, nfd):
    out = morev_transcribe(thai)
    assert nfd(out) == nfd(expected)
